# -*- coding:utf-8 -*-
# Author: lqxu

from core import text_rank_for_summary


def test_consistence():
    test_docs_v1 = [
        ['水利部', '水资源', '司', '司长', '陈明忠', '9月', '国务院新闻办', '举行', '新闻', '发布会', '透露'],
        ['刚刚', '完成', '水资源', '管理制度', '考核'],
        ['部分', '省', '接近', '红线', '指标'],
        ['部分', '省', '超过', '红线', '指标'],
        ['超过', '红线', '地方'],
        ['陈明忠', '表示'],
        ['取', '用水', '项目', '进行', '区域', '限'],
        ['严格', '进行', '水资源', '论证', '取水', '许可', '批准'],
    ]
    
    test_docs_v2 = [
        ['水利部', '水资源', '司', '司长', '陈明忠', '9月', '国务院', '新闻办', '举行', '新闻', '发布会', '透露'],
        ['刚刚', '完成', '水资源', '管理', '制度', '考核'],
        ['部分', '省', '接近', '红线', '指标'],
        ['部分', '省', '超过', '红线', '指标'],
        ['超过', '红线', '地方'],
        ['陈明忠', '表示'],
        ['取', '用水', '项目', '进行', '区域', '限'],
        ['严格', '进行', '水资源', '论证', '取水', '许可', '批准'],
    ]

    print(text_rank_for_summary(test_docs_v1))
    
    import time 
    s = time.time()
    print(text_rank_for_summary(test_docs_v1))
    print(time.time() - s)
    
    print(text_rank_for_summary(test_docs_v2))


if __name__ == "__main__":
    test_consistence()
